//  Напишите программу, которая на вход принимает число и выдаёт, 
// является ли число чётным (делится ли оно на два без остатка).

Console.Write("Введите число a ");
double number1 = Convert.ToInt32(Console.ReadLine());
if (number1 / 2 ==)